<?php
if (empty($_SESSION['csrf_token'])) {
	$_SESSION['csrf_token'] = bin2hex(random_bytes(32));
}
?>

<!DOCTYPE html>
<html>

<head>
	<meta charset="UTF-8">
	<title><?= $title ?></title>
	<link rel="icon" href="/SweetLolly_new/project/webroot/resources/logo.png" type="image/png">
	<link rel="stylesheet" href="/SweetLolly_new/project/webroot/styles/reset.css">
	<link rel="stylesheet" href="/SweetLolly_new/project/webroot/styles/global.css">
</head>

<body>
	<header>
		<div class="container">
			<div class="header">
				<a href="/SweetLolly_new/" class="logo">
					<svg width="30" height="30" viewBox="0 0 26 26" fill="currentColor"
						xmlns="http://www.w3.org/2000/svg">
						<path
							d="M25.0956 8.23612C26.6282 12.138 26.2493 16.708 23.68 20.4108C21.1107 24.1137 16.9622 26.0683 12.7707 25.9982L25.0956 8.23612Z" />
						<path
							d="M15.8284 0.309587C17.426 0.665061 18.983 1.32942 20.4108 2.32014C21.8384 3.31078 23.0054 4.5367 23.8975 5.90877L10.1714 25.6904C8.57391 25.3349 7.01698 24.6708 5.58931 23.6801C4.16151 22.6894 2.99446 21.4632 2.10229 20.0909L15.8284 0.309587Z" />
						<path
							d="M2.32007 5.58943C4.88929 1.88673 9.03749 -0.0681167 13.2288 0.00181279L0.904213 17.7639C-0.628283 13.8621 -0.249101 9.29214 2.32007 5.58943Z" />
					</svg>
					<div class="header-title">
						<h2>SWEETLOLLY</h2>
						<h3 id="textBlock"></h3>
						<script>
							document.addEventListener('DOMContentLoaded', () => {
								const texts = [
									'СЛюбовью', 'Леденец', 'Мармеладный', 'Сладкий',
									'Новый и крутой!', '#withLove', 'Мы точно сладкие!', 'Веселье. Друзья. Сладости',
									'Режимы и мини-игры', 'Я вижу тебя!', 'Заходи скорее!', 'Рад тебя видеть!',
									'Разрабатываю новый режим...', 'Придумываю новые веселья', 'Ого, я твой фанат!', 'Мммм... Люблю сладкое!',
								];
								const $textBlock = document.querySelector('#textBlock');

								// Эффект печатания
								function writeText(callback) {
									let current = '';
									let text = texts[Math.floor(Math.random() * texts.length)];
									$textBlock.textContent = '';

									for (let i = 0; i < text.length; i++) {
										setTimeout(() => {
											current += text[i];
											$textBlock.textContent = current;

											if (i === text.length - 1 && callback) {
												callback();
											}
										}, 120 * i);
									}
								}

								function startTyping() {
									writeText(() => {
										setTimeout(startTyping, 6000);
									});
								}

								setTimeout(startTyping, 0);
							});
						</script>
					</div>
				</a>
				<div class="user-theme">
					<div class="theme-toggle" data-theme-toggle></div>

					<?php if (!empty($_SESSION['logged_in'])): ?>
						<div class="user user-logged">
							<a class="user-logg-a"
								href="/SweetLolly_new/profile/<?= htmlspecialchars($_SESSION['nickname'] ?? '') ?>/">
								<img src="/SweetLolly_new/project/webroot/resources/noavatar.jpg" alt="avatar">
								<p><?= htmlspecialchars($_SESSION['nickname'] ?? 'Игрок') ?></p>
							</a>
							<a href="/SweetLolly_new/logout/" class="logout">
								<svg width="20" height="20" fill="currentColor" viewBox="0 0 24 24"
									transform="scale(-1,1) ">
									<path d="M15 11H8v2h7v4l6-5-6-5z" />
									<path d="M5 21h7v-2H5V5h7V3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2" />
								</svg>
							</a>
						</div>
					<?php else: ?>
						<a class="user" href="/SweetLolly_new/login/">
							<svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" fill="currentColor"
								viewBox="0 0 24 24">
								<path
									d="M12 2a5 5 0 1 0 0 10 5 5 0 1 0 0-10M4 22h16c.55 0 1-.45 1-1v-1c0-3.86-3.14-7-7-7h-4c-3.86 0-7 3.14-7 7v1c0 .55.45 1 1 1">
								</path>
							</svg>
							<p>Войти</p>
						</a>
					<?php endif; ?>

					<script src="/SweetLolly_new/project/webroot/scripts/theme.js"></script>
				</div>
			</div>
		</div>
		</div>
	</header>
	<section class="hero-nav">
		<div class="container">
			<div class="hero-row">
				<a href="SweetLolly_new/" class="site-logo" aria-label="SweetLolly">
					<img src="/SweetLolly_new/project/webroot/resources/logo.png" style="max-width: 80%;">
				</a>
				<div class="promo">
					<div>Присоединись к игрокам<br>уже сейчас!</div>
					<a href="./howto/" class="btn btn-lollypop">Начать играть :)</a>
					<br>
					<div class="clipboard">
						<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor"
							viewBox="0 0 24 24">
							<rect width="14" height="14" x="8" y="2" rx="2" ry="2"></rect>
							<path
								d="M8.5 18A2.5 2.5 0 0 1 6 15.5V8H4c-1.1 0-2 .9-2 2v10c0 1.1.9 2 2 2h10c1.1 0 2-.9 2-2v-2z">
							</path>
						</svg>
						<p>IP:</p>
						<span class="copy_id">play.swetlolly.net</span>
					</div>
				</div>
			</div>
			<nav class="main-menu">
				<a href="/SweetLolly_new/forum/">
					<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor"
						viewBox="0 0 24 24">
						<path
							d="M12 2C6.49 2 2 6.49 2 12c0 2.12.68 4.19 1.93 5.9l-1.75 2.53c-.21.31-.24.7-.06 1.03.17.33.51.54.89.54h9c5.51 0 10-4.49 10-10S17.51 2 12 2M6 9h3v2H6zm7 6H6v-2h7zm5 0h-3v-2h3zm0-4h-7V9h7z">
						</path>
					</svg>
					Форум
				</a>
				<a href="/SweetLolly_new/rules/">
					<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor"
						viewBox="0 0 24 24" transform="scale(-1,1) ">
						<path
							d="M2 20h13v2H2zM18.71 8.71a.996.996 0 0 0 0-1.41l-5-5a.996.996 0 0 0-1.41 0l-1.29 1.29L17.42 10zm-10.42 9c.2.2.45.29.71.29s.51-.1.71-.29L11 16.42l-6.41-6.41L3.3 11.3a.996.996 0 0 0 0 1.41l5 5Zm5.21-3.8 6.79 6.8 1.42-1.42-6.8-6.79L16 11.41 9.59 5 6 8.59 12.41 15z">
						</path>
					</svg>
					Правила
				</a>
				<a href="/SweetLolly_new/games/">
					<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor"
						viewBox="0 0 24 24">
						<path
							d="M19 2H5c-1.1 0-2 .9-2 2v16c0 1.1.9 2 2 2h11c2.76 0 5-2.24 5-5V4c0-1.1-.9-2-2-2m-7 16h-2v2H8v-2H6v-2h2v-2h2v2h2zm3 1c-.55 0-1-.45-1-1s.45-1 1-1 1 .45 1 1-.45 1-1 1m2-2c-.55 0-1-.45-1-1s.45-1 1-1 1 .45 1 1-.45 1-1 1m1-5H6V5h12z">
						</path>
					</svg>
					Режимы
				</a>
				<a href="/SweetLolly_new/candies/">
					<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor"
						viewBox="0 0 24 24">
						<path
							d="M21 8H7c-.55 0-1 .45-1 1v10c0 .55.45 1 1 1h14c.55 0 1-.45 1-1V9c0-.55-.45-1-1-1m-1 8c-1.1 0-2 .9-2 2h-8c0-1.1-.9-2-2-2v-4c1.1 0 2-.9 2-2h8c0 1.1.9 2 2 2z">
						</path>
						<path d="M18 4H3c-.55 0-1 .45-1 1v11h2V6h14zm-4 8a2 2 0 1 0 0 4 2 2 0 1 0 0-4"></path>
					</svg>
					Леденцы
				</a>
				<a href="/SweetLolly_new/help/">
					<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="currentColor"
						viewBox="0 0 24 24">
						<path
							d="M12 22c5.51 0 10-4.49 10-10S17.51 2 12 2 2 6.49 2 12s4.49 10 10 10M11 7h2v2h-2zm0 4h2v6h-2z">
						</path>
					</svg>
					Помощь
				</a>
			</nav>
		</div>
	</section>

	<?= $content ?>

	<footer class="lolli-footer">
		
		<div class="footer-top">
			<div class="container">
				<div class="row">
					<div style="display: flex; gap: 15px; align-items: start;">
						<img src="/SweetLolly_new/project/webroot/resources/footer.png" />
						<div class="footer-text">
							<h3>Добро пожаловать на </br>сайт сервера <b
									style="color: var(--accent); font-weight: 700;">SweetLolly</b> :)</h3>
							<h4>Следи за новостями, общайся на форуме, изучай режимы, получай </br>помощь и управляй
								своим аккаунтом — всё в одном удобном месте.</h4>
							<p>Email для связи: <b
									style="color: var(--accent); font-weight: 700;">sweetauth.project@gmail.com</b></p>
						</div>
					</div>
					<div class="footer-navigation">
						<h3>Навигация</h3>
						<nav class="footer-nav">
							<a href="/SweetLolly_new/rules/">
								<svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" fill="currentColor"
									viewBox="0 0 24 24" transform="scale(-1,1) ">
									<path
										d="M2 20h13v2H2zM18.71 8.71a.996.996 0 0 0 0-1.41l-5-5a.996.996 0 0 0-1.41 0l-1.29 1.29L17.42 10zm-10.42 9c.2.2.45.29.71.29s.51-.1.71-.29L11 16.42l-6.41-6.41L3.3 11.3a.996.996 0 0 0 0 1.41l5 5Zm5.21-3.8 6.79 6.8 1.42-1.42-6.8-6.79L16 11.41 9.59 5 6 8.59 12.41 15z">
									</path>
								</svg>
								Правила
							</a>
							<a href="/SweetLolly_new/games/">
								<svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" fill="currentColor"
									viewBox="0 0 24 24">
									<path
										d="M19 2H5c-1.1 0-2 .9-2 2v16c0 1.1.9 2 2 2h11c2.76 0 5-2.24 5-5V4c0-1.1-.9-2-2-2m-7 16h-2v2H8v-2H6v-2h2v-2h2v2h2zm3 1c-.55 0-1-.45-1-1s.45-1 1-1 1 .45 1 1-.45 1-1 1m2-2c-.55 0-1-.45-1-1s.45-1 1-1 1 .45 1 1-.45 1-1 1m1-5H6V5h12z">
									</path>
								</svg>
								Режимы
							</a>
							<a href="/SweetLolly_new/candies/">
								<svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" fill="currentColor"
									viewBox="0 0 24 24">
									<path
										d="M21 8H7c-.55 0-1 .45-1 1v10c0 .55.45 1 1 1h14c.55 0 1-.45 1-1V9c0-.55-.45-1-1-1m-1 8c-1.1 0-2 .9-2 2h-8c0-1.1-.9-2-2-2v-4c1.1 0 2-.9 2-2h8c0 1.1.9 2 2 2z">
									</path>
									<path d="M18 4H3c-.55 0-1 .45-1 1v11h2V6h14zm-4 8a2 2 0 1 0 0 4 2 2 0 1 0 0-4">
									</path>
								</svg>
								Леденцы
							</a>
							<a href="/SweetLolly_new/help/">
								<svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" fill="currentColor"
									viewBox="0 0 24 24">
									<path
										d="M12 22c5.51 0 10-4.49 10-10S17.51 2 12 2 2 6.49 2 12s4.49 10 10 10M11 7h2v2h-2zm0 4h2v6h-2z">
									</path>
								</svg>
								Помощь
							</a>
						</nav>
					</div>
					<div class="footer-community">
						<h3>Сообщество</h3>
						<nav class="footer-nav">
							<a href="./forum/">
								<svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" fill="currentColor"
									viewBox="0 0 24 24">
									<path
										d="M12 2C6.49 2 2 6.49 2 12c0 2.12.68 4.19 1.93 5.9l-1.75 2.53c-.21.31-.24.7-.06 1.03.17.33.51.54.89.54h9c5.51 0 10-4.49 10-10S17.51 2 12 2M6 9h3v2H6zm7 6H6v-2h7zm5 0h-3v-2h3zm0-4h-7V9h7z">
									</path>
								</svg>
								Форум
							</a>
							<a href="https://www.instagram.com/sweetlolly.project/">
								<svg width="22" height="22" viewBox="0 0 22 22" fill="cuttentColor"
									xmlns="http://www.w3.org/2000/svg">
									<path
										d="M11 8.13619C9.42303 8.13619 8.13611 9.4231 8.13611 11.0001C8.13611 12.577 9.42303 13.8639 11 13.8639C12.5769 13.8639 13.8638 12.577 13.8638 11.0001C13.8638 9.4231 12.5769 8.13619 11 8.13619ZM19.5894 11.0001C19.5894 9.81412 19.6002 8.63892 19.5336 7.45513C19.467 6.08013 19.1533 4.85982 18.1478 3.85435C17.1402 2.84673 15.9221 2.53521 14.5471 2.46861C13.3611 2.40201 12.1859 2.41275 11.0021 2.41275C9.81619 2.41275 8.641 2.40201 7.45721 2.46861C6.08221 2.53521 4.86189 2.84888 3.85643 3.85435C2.84881 4.86197 2.53728 6.08013 2.47068 7.45513C2.40408 8.64107 2.41482 9.81626 2.41482 11.0001C2.41482 12.1838 2.40408 13.3612 2.47068 14.545C2.53728 15.92 2.85096 17.1403 3.85643 18.1458C4.86404 19.1534 6.08221 19.4649 7.45721 19.5315C8.64314 19.5981 9.81834 19.5874 11.0021 19.5874C12.1881 19.5874 13.3633 19.5981 14.5471 19.5315C15.9221 19.4649 17.1424 19.1512 18.1478 18.1458C19.1554 17.1381 19.467 15.92 19.5336 14.545C19.6023 13.3612 19.5894 12.186 19.5894 11.0001ZM11 15.4065C8.5615 15.4065 6.59353 13.4385 6.59353 11.0001C6.59353 8.56158 8.5615 6.59361 11 6.59361C13.4385 6.59361 15.4064 8.56158 15.4064 11.0001C15.4064 13.4385 13.4385 15.4065 11 15.4065ZM15.5869 7.44224C15.0176 7.44224 14.5578 6.98248 14.5578 6.41314C14.5578 5.8438 15.0176 5.38404 15.5869 5.38404C16.1562 5.38404 16.616 5.8438 16.616 6.41314C16.6162 6.54833 16.5897 6.68223 16.538 6.80716C16.4863 6.93209 16.4106 7.04561 16.315 7.1412C16.2194 7.2368 16.1058 7.31259 15.9809 7.36425C15.856 7.41591 15.7221 7.44241 15.5869 7.44224Z" />
								</svg>
								Instagram
							</a>
							<a href="https://discord.com/invite/bqkBcVxPen">
								<svg width="20" height="20" viewBox="0 0 20 20" fill="currentColor"
									xmlns="http://www.w3.org/2000/svg">
									<path
										d="M16.9309 3.7433C15.6559 3.1683 14.2892 2.7433 12.86 2.50163C12.8473 2.49919 12.8341 2.50076 12.8223 2.50614C12.8105 2.51151 12.8007 2.52042 12.7942 2.53163C12.6192 2.83913 12.4242 3.23997 12.2875 3.55663C10.7717 3.33058 9.23082 3.33058 7.71503 3.55663C7.56339 3.20541 7.39172 2.86318 7.20087 2.53163C7.19417 2.52052 7.18437 2.5116 7.17267 2.50598C7.16098 2.50035 7.1479 2.49826 7.13504 2.49997C5.7067 2.74163 4.34003 3.16663 3.0642 3.74247C3.05382 3.748 3.04474 3.75567 3.03753 3.76497C0.444201 7.57747 -0.266632 11.2958 0.0825343 14.9675C0.0835059 14.9765 0.0862973 14.9852 0.0907384 14.993C0.0951796 15.0009 0.101178 15.0078 0.108368 15.0133C1.62178 16.1157 3.31014 16.9553 5.10253 17.4966C5.11504 17.5003 5.12834 17.5001 5.14078 17.4963C5.15322 17.4924 5.16426 17.485 5.17253 17.475C5.55765 16.9588 5.89938 16.4117 6.1942 15.8391C6.19829 15.8313 6.20064 15.8227 6.2011 15.8139C6.20157 15.805 6.20013 15.7962 6.19689 15.788C6.19365 15.7798 6.18868 15.7724 6.18233 15.7662C6.17597 15.7601 6.16837 15.7554 6.16003 15.7525C5.62143 15.5504 5.09978 15.3057 4.60003 15.0208C4.59105 15.0157 4.58348 15.0084 4.578 14.9996C4.57252 14.9908 4.56931 14.9808 4.56865 14.9705C4.56798 14.9602 4.5699 14.9499 4.57421 14.9405C4.57853 14.9311 4.58511 14.9229 4.59337 14.9166C4.69892 14.8389 4.80226 14.7591 4.90337 14.6775C4.91257 14.6706 4.92339 14.6662 4.93477 14.6648C4.94616 14.6633 4.95773 14.6648 4.96837 14.6691C8.24087 16.1391 11.785 16.1391 15.0192 14.6691C15.0299 14.6645 15.0416 14.6628 15.0531 14.6641C15.0647 14.6654 15.0757 14.6698 15.085 14.6766C15.185 14.7589 15.2884 14.8389 15.395 14.9166C15.4034 14.9227 15.4101 14.9308 15.4145 14.9401C15.419 14.9495 15.421 14.9597 15.4205 14.9701C15.42 14.9804 15.417 14.9904 15.4117 14.9993C15.4064 15.0081 15.3989 15.0155 15.39 15.0208C14.8928 15.3069 14.3725 15.5505 13.8292 15.7516C13.8208 15.7547 13.8132 15.7594 13.8069 15.7657C13.8005 15.7719 13.7955 15.7794 13.7923 15.7876C13.7891 15.7959 13.7876 15.8048 13.7881 15.8137C13.7886 15.8226 13.7909 15.8312 13.795 15.8391C14.095 16.4116 14.4384 16.9566 14.8159 17.4741C14.8239 17.4845 14.8349 17.4922 14.8473 17.4964C14.8598 17.5005 14.8732 17.5009 14.8859 17.4975C16.6809 16.9566 18.3719 16.1168 19.8875 15.0133C19.8948 15.008 19.9009 15.0013 19.9055 14.9935C19.91 14.9858 19.913 14.9772 19.9142 14.9683C20.3309 10.7233 19.2159 7.03497 16.9567 3.76663C16.9512 3.75601 16.942 3.74773 16.9309 3.7433ZM6.68337 12.7316C5.69837 12.7316 4.88587 11.8408 4.88587 10.7483C4.88587 9.65496 5.68254 8.76497 6.68337 8.76497C7.6917 8.76497 8.4967 9.66246 8.48087 10.7483C8.48087 11.8416 7.6842 12.7316 6.68337 12.7316ZM13.3292 12.7316C12.3434 12.7316 11.5317 11.8408 11.5317 10.7483C11.5317 9.65496 12.3275 8.76497 13.3292 8.76497C14.3375 8.76497 15.1425 9.66246 15.1267 10.7483C15.1267 11.8416 14.3384 12.7316 13.3292 12.7316Z" />
								</svg>
								Discord
							</a>
							<a href="https://www.youtube.com/@SweetLollyYT">
								<svg width="22" height="22" viewBox="0 0 22 22" fill="currentColor"
									xmlns="http://www.w3.org/2000/svg">
									<path
										d="M20.2232 6.36152C20.1137 5.9534 19.8988 5.58122 19.6002 5.28223C19.3016 4.98323 18.9297 4.76791 18.5217 4.65781C17.0199 4.25391 11 4.25391 11 4.25391C11 4.25391 4.98008 4.25391 3.47832 4.65566C3.07016 4.7654 2.69806 4.98061 2.39939 5.27966C2.10071 5.57871 1.88598 5.95108 1.77676 6.35938C1.375 7.86328 1.375 11 1.375 11C1.375 11 1.375 14.1367 1.77676 15.6385C1.99805 16.4678 2.65117 17.1209 3.47832 17.3422C4.98008 17.7461 11 17.7461 11 17.7461C11 17.7461 17.0199 17.7461 18.5217 17.3422C19.351 17.1209 20.002 16.4678 20.2232 15.6385C20.625 14.1367 20.625 11 20.625 11C20.625 11 20.625 7.86328 20.2232 6.36152ZM9.08789 13.8789V8.12109L14.0723 10.9785L9.08789 13.8789Z" />
								</svg>
								YouTube
							</a>
							<a href="https://t.me/+-N_b9e6CGt45MGZk">
								<svg width="22" height="22" viewBox="0 0 22 22" fill="currentColor"
									xmlns="http://www.w3.org/2000/svg">
									<path
										d="M10.9551 1.37503C8.41018 1.3869 5.97354 2.4062 4.1782 4.20995C2.38287 6.0137 1.37497 8.45508 1.375 11C1.375 13.5527 2.38906 16.0009 4.1941 17.8059C5.99913 19.611 8.44729 20.625 11 20.625C13.5527 20.625 16.0009 19.611 17.8059 17.8059C19.6109 16.0009 20.625 13.5527 20.625 11C20.625 8.44732 19.6109 5.99916 17.8059 4.19412C16.0009 2.38909 13.5527 1.37503 11 1.37503C10.985 1.37499 10.9701 1.37499 10.9551 1.37503ZM14.935 7.16928C15.0152 7.16767 15.1925 7.18773 15.308 7.28158C15.3847 7.34824 15.4337 7.44125 15.4451 7.54224C15.458 7.61684 15.474 7.78768 15.4612 7.92082C15.3168 9.44318 14.6896 13.136 14.3704 14.8404C14.2356 15.5623 13.9701 15.8037 13.7126 15.827C13.1544 15.8791 12.7301 15.458 12.1887 15.1035C11.3417 14.5476 10.8628 14.202 10.0407 13.6597C9.09023 13.0341 9.70623 12.6892 10.2476 12.1278C10.3896 11.9802 12.852 9.73995 12.9001 9.53703C12.9058 9.51135 12.9114 9.41671 12.8552 9.36698C12.7991 9.31724 12.7157 9.33411 12.6555 9.34773C12.5705 9.36698 11.2174 10.2621 8.59616 12.0307C8.21116 12.2954 7.86386 12.4237 7.55184 12.4157C7.20854 12.4093 6.54764 12.2224 6.05595 12.0628C5.4528 11.8663 4.97395 11.7628 5.01566 11.4299C5.03731 11.2567 5.27633 11.0794 5.73192 10.8982C8.53761 9.67579 10.4081 8.8697 11.3449 8.48068C14.0174 7.36899 14.5733 7.1757 14.935 7.16928Z" />
								</svg>
								Telegram
							</a>
						</nav>
					</div>
				</div>
			</div>
		</div>

		<div class="footer-bottom">
			<p>SweetLolly.net © 2022-2026</p>
		</div>
	</footer>
</body>

<script src="/SweetLolly_new/project/webroot/scripts/test.js"></script>

</html>